nixos/_mixins/base/emacs-config.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle yes

* Start-Up Procedure
** Repositories
#+begin_src emacs-lisp
    (require 'package)
    (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			     ("elpa" . "https://elpa.gnu.org/packages/")
			     ("nongnu" . "https://elpa.nongnu.org/nongnu/")
			     )
	  )
			     ;; ("dnd" . "~/DND/")))

;;    (package-initialize)
#+end_src

** Configure =use-package=

I use =use-package= to install and configure my packages.
My =init.el= includes the initial setup for =package.el=
and ensures that =use-package= is installed, since I
wanna do that right away.

This makes sure that =use-package= will install the
package if it's not already available. It also means that
I should be able to open Emacs for the first time on a
fresh Debian box and have my whole environment automatically
installed. I'm not /totally/ sure about that, but we're
gettin' close.

#+begin_src emacs-lisp
  (when (not (package-installed-p 'use-package))
	(package-refresh-contents)
	(package-install 'use-package))
  (require 'use-package)
#+end_src

#+begin_src emacs-lisp
;  (require 'use-package-ensure)
  (setq use-package-always-ensure t)
#+end_src

Always compile packages, and use the newest version available.

#+begin_src emacs-lisp
  (use-package auto-compile
    :commands auto-compile-mode
    :config (auto-compile-on-load-mode))
  (setq load-prefer-newer t)
#+end_src

** Emacs Server
Starts the emacs server. If I open new files using emacsclient, also displayed as emacs (client), they will be opened in the same emacs instance. Without this, the files will be opened in a new emacs instance. Which is very annoying if you have a bunch of stuff that runs on startup, like I do here.
#+begin_src
  (server-start)
#+end_src

** garbage collecting
#+begin_src emacs-lisp
  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 511 1024 1024))
  (setq gc-cons-percentage 0.9)
  (run-with-idle-timer 5 t #'garbage-collect)
  (setq garbage-collection-messages t)
#+end_src

** Identify system it's running on
This is from Sacha Chua's dot file. Want to give it a try as I don't need a bunch of the
packages on the server version than I do for my normal computers.
#+begin_src emacs-lisp
  (defvar my-laptop-p (equal (system-name) "shyfox"))
  (defvar my-server-p (and (equal (system-name) "localhost") (equal user-login-name "sg1")))
  ;; (defvar my-phone-p (not (null (getenv "ANDROID_ROOT")))
  ;; (global-auto-revert-mode)  ; simplifies syncing
#+end_src

* Set personal information

** Who am I? Where am I?
#+begin_src emacs-lisp
  (setq user-full-name "Zach Bombay"
	user-mail-address "zacharybombay@gmail.com"
	calendar-latitude 0.0
	calendar-longitude 0.0
	calendar-location-name "")
#+end_src

* UI
** Highlight Line Mode
#+begin_src emacs-lisp
(global-hl-line-mode 1)
#+end_src

** Tweak window chrome

I don't usually use the scroll bar. Testing using the Menu bar again

#+begin_src emacs-lisp
 (setq inhibit-startup-message t)
 (tool-bar-mode 0)
;    (menu-bar-mode 0)
 (scroll-bar-mode -1)
 (tooltip-mode -1)
;    (setq global-linum-mode t)
 (column-number-mode t)
 (add-hook 'before-save-hook 'delete-trailing-whitespace)
;    (set-fringe-mode 10)
 (setq visible-bell t)
#+end_src

** Cursor
#+begin_src emacs-lisp
  (setq-default cursor-type 'box)
#+end_src

** clock
#+begin_src emacs-lisp
  (setq display-time-24hr-format nil)
  (setq display-time-format "%H:%M / %d-%b-%Y  | ")
#+end_src

#+begin_src emacs-lisp
  (display-time-mode 1)
#+end_src

** Load up a theme
#+begin_src emacs-lisp
  (load-theme 'modus-vivendi-deuteranopia t)
#+end_src
    # kaolin-ocean
    # misterioso-theme
    # abyss-theme
    # underwater-theme
    # challenger-deep-theme
    # cyberpunk-theme
    # dakrone-theme
    # dracula-theme
    # espresso-theme
    # exotica-theme

** Ido mode

#+begin_src emacs-lisp
  (setq ido-enable-flex-matching t)
  (setq ido-everywhere t)
  (setq ido-use-filename-at-point 'guess)
  (ido-mode 1)
#+end_src

** Visual Line Mode
Line wrapping
#+begin_src emacs-lisp
  (global-visual-line-mode)
#+end_src

** SpaceLine
Spacemacs themed mode-line
# #+begin_src emacs-lisp
# (use-package spaceline
#   :ensure t
#   :config
#   (require 'spaceline-config)
#     (setq spaceline-buffer-encoding-abbrev-p nil)
#     (setq spaceline-line-column-p nil)
#     (setq spaceline-line-p nil)
#     (setq powerline-default-separator (quote arrow))
#     (spaceline-spacemacs-theme))
# #+end_src

# remove the seperation between the spaceline bits

# #+begin_src emacs-lisp
# (setq powerline-default-separator nil)
# #+end_src

** Use =moody= for a beautiful modeline

This gives me a truly lovely ribbon-based modeline.

#+begin_src emacs-lisp
    (use-package moody
      :config
      (setq x-underline-at-descent-line t
	    moody-mode-line-height 30)
    (moody-replace-mode-line-buffer-identification)
    (moody-replace-vc-mode))
#+end_src

** Use =minions= to hide all minor modes

I never want to see a minor mode, and manually adding =:diminish= to every
use-package declaration is a hassle. This uses =minions= to hide all the minor
modes in the modeline. Nice!

By default there's a =;-)= after the major mode; that's an adorable default, but
I'd rather skip it.

#+begin_src emacs-lisp
  (use-package minions
    :ensure t
    :config
    (setq minions-mode-line-lighter ""
	  minions-mode-line-delimiters '("" . ""))
    (minions-mode 1))
#+end_src

** Set default font and configure font resizing

I'm partial to Source Code Pro.

#+begin_src emacs-lisp
    (set-face-attribute 'default nil :font "Source Code Pro" :height 105)
    (setq zb/default-font-size 12)
    (setq zb/current-font-size zb/default-font-size)
#+end_src

** Frame name

The default frame title isn't useful. This binds it
to the name of the current project:

#+begin_src emacs-lisp
  (setq frame-title-format (system-name))
;  (setq frame-title-format "%b")
  ;; (setq frame-title-format '((:eval (projectile-project-name))))
#+end_src
** UTF-8 complience

#+begin_src emacs-lisp
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (setq-default buffer-file-coding-system 'utf-8)
#+end_src

** Unicode fonts

#+begin_src emacs-lisp
  (require 'unicode-fonts)
  (unicode-fonts-setup)
#+end_src

** change yes / no to y/n
#+begin_src emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)
#+end_src

* Backups
#+begin_src emacs-lisp
  (setq auto-save-file-name-transforms '((".*" "~/.config/emacs/emacs_autosave/" t)))
  (setq backup-directory-alist '(("." . "~/.config/emacs/backups")))
  (setq backup-by-copying t)
#+end_src

* keybinding
** define sync folder
#+begin_src emacs-lisp
    (cond
       ((string-equal system-type "windows-nt")
	(defvar sync_folder "C:/Users/zacha/sync/"))
       (
	(if my-laptop-p (string-equal system-type "gnu/linux")
	 (defvar sync_folder "~/Sync/"))
  )
       )
  (defvar nix_folder "~/Zero/nix-config/")
#+end_src

** Quickly visit Emacs configuration

I futz around with my dotfiles a lot. This binds =C-c e= to quickly open my
Emacs configuration file.

#+begin_src emacs-lisp
  (defun zb/visit-emacs-config ()
  (interactive)
  (find-file (concat nix_folder "nixos/_mixins/base/emacs-config.org")))
  (global-set-key (kbd "C-c e") 'zb/visit-emacs-config)
#+end_src

** Quickly visit NixOs configuration

I futz around with my NixOS config a lot. This binds =C-c n= to quickly open the flake.nix configuration file.

#+begin_src emacs-lisp
  (defun zb/visit-nixos-config ()
  (interactive)
  (find-file (concat nix_folder "flake.nix")))
  (global-set-key (kbd "C-c n") 'zb/visit-nixos-config)
#+end_src

More often than not, I'm tinkering with the specific machine. Here I can directly get to the boxes default.nix
#+begin_src emacs-lisp
  (defun zb/visit-machine-nixos-config ()
  (interactive)
  (find-file (concat nix_folder "nixos/" (system-name) "/default.nix")))
  (global-set-key (kbd "C-c m") 'zb/visit-machine-nixos-config)
#+end_src

** Always kill current buffer

Assume that I always want to kill the current buffer when hitting =C-x k=.

#+begin_src emacs-lisp
  (defun zb/kill-current-buffer ()
    "Kill the current buffer without prompting."
    (interactive)
    (kill-buffer (current-buffer)))

  (global-set-key (kbd "C-x k") 'zb/kill-current-buffer)
#+end_src

** iBuffer
#+begin_src emacs-lisp
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+end_src

** Electric

If you put in a completing pair (like these parenthasis or quotes), this will complete the pair when you enter the first character.
#+begin_src emacs-lisp
  (setq electric-pair-pairs '(
			     (?\{ . ?\})
			     (?\( . ?\))
			     (?\[ . ?\])
			     (?\" . ?\")
			     ))
  (setq electric-pair-inhibit-predicate (lambda (c) (char-equal c ?<)))
  ;; (setq electric-pair-inhibit-predicate
  ;;     `(lambda (c)
  ;;        (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c)))))
#+end_src

#+begin_src emacs-lisp
  (electric-pair-mode t)
  (show-paren-mode 1)
#+end_src

** Rainbow
If emacs sees a hex color value, it will change its color to match that value
#+begin_src emacs-lisp
(use-package rainbow-mode
  :ensure t
  :init
  (add-hook 'prog-mode-hook 'rainbow-mode))
#+end_src

** Rainbox Deliminators
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :ensure t
  :init
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
#+end_src

** Expand region
Starts by selecting the word the curror is currently on. Hit it again
and the selected region expands. Repeat until the whole buffer is selected
#+begin_src emacs-lisp
(use-package expand-region
  :ensure t
  :bind ("C-q" . er/expand-region))
#+end_src

* Org-mode
** To-Do strikethrough Done
#+begin_src emacs-lisp
(setq org-fontify-done-headline t)
(custom-set-faces
 '(org-done ((t (:foreground "PaleGreen"
                             :weight normal
                             :strike-through t))))
 '(org-headline-done
   ((((class color) (min-colors 16) (background dark))
     (:foreground "LightSalmon" :strike-through t)))))
#+end_src

** Org-keybingings
Bind a few handy keys.

#+begin_src emacs-lisp
  ;  (define-key global-map "\C-cl" 'org-store-link)
   ;; (define-key global-map "\C-ca" 'org-agenda)
    (define-key global-map "\C-cc" 'org-capture)
#+end_src

