nixos/_mixins/base/emacs-config.el
(require 'package)
    (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			     ("elpa" . "https://elpa.gnu.org/packages/")
			     ("nongnu" . "https://elpa.nongnu.org/nongnu/")
			     )
	  )
			     ;; ("dnd" . "~/DND/")))

;;    (package-initialize)

(when (not (package-installed-p 'use-package))
	(package-refresh-contents)
	(package-install 'use-package))
(require 'use-package)

;  (require 'use-package-ensure)
  (setq use-package-always-ensure t)

(use-package auto-compile
  :commands auto-compile-mode
  :config (auto-compile-on-load-mode))
(setq load-prefer-newer t)

;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 511 1024 1024))
(setq gc-cons-percentage 0.9)
(run-with-idle-timer 5 t #'garbage-collect)
(setq garbage-collection-messages t)

(defvar my-laptop-p (equal (system-name) "shyfox"))
(defvar my-server-p (and (equal (system-name) "localhost") (equal user-login-name "sg1")))
;; (defvar my-phone-p (not (null (getenv "ANDROID_ROOT")))
;; (global-auto-revert-mode)  ; simplifies syncing

(setq user-full-name "Zach Bombay"
	user-mail-address "zacharybombay@gmail.com"
	calendar-latitude 0.0
	calendar-longitude 0.0
	calendar-location-name "")

(global-hl-line-mode 1)

(setq inhibit-startup-message t)
 (tool-bar-mode 0)
;    (menu-bar-mode 0)
 (scroll-bar-mode -1)
 (tooltip-mode -1)
;    (setq global-linum-mode t)
 (column-number-mode t)
 (add-hook 'before-save-hook 'delete-trailing-whitespace)
;    (set-fringe-mode 10)
 (setq visible-bell t)

(setq-default cursor-type 'box)

(setq display-time-24hr-format nil)
(setq display-time-format "%H:%M / %d-%b-%Y  | ")

(display-time-mode 1)

(load-theme 'modus-vivendi-deuteranopia t)

(setq ido-enable-flex-matching t)
(setq ido-everywhere t)
(setq ido-use-filename-at-point 'guess)
(ido-mode 1)

(global-visual-line-mode)

(use-package moody
  :config
  (setq x-underline-at-descent-line t
	    moody-mode-line-height 30)
(moody-replace-mode-line-buffer-identification)
(moody-replace-vc-mode))

(use-package minions
  :ensure t
  :config
  (setq minions-mode-line-lighter ""
	  minions-mode-line-delimiters '("" . ""))
  (minions-mode 1))

(set-face-attribute 'default nil :font "Source Code Pro" :height 105)
(setq zb/default-font-size 12)
(setq zb/current-font-size zb/default-font-size)

(setq frame-title-format (system-name))
;  (setq frame-title-format "%b")
  ;; (setq frame-title-format '((:eval (projectile-project-name))))

(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(setq-default buffer-file-coding-system 'utf-8)

(require 'unicode-fonts)
(unicode-fonts-setup)

(fset 'yes-or-no-p 'y-or-n-p)

(setq auto-save-file-name-transforms '((".*" "~/.config/emacs/emacs_autosave/" t)))
(setq backup-directory-alist '(("." . "~/.config/emacs/backups")))
(setq backup-by-copying t)

(cond
     ((string-equal system-type "windows-nt")
	(defvar sync_folder "C:/Users/zacha/sync/"))
     (
	(if my-laptop-p (string-equal system-type "gnu/linux")
	 (defvar sync_folder "~/Sync/"))
)
     )
(defvar nix_folder "~/Zero/nix-config/")

(defun zb/visit-emacs-config ()
(interactive)
(find-file (concat nix_folder "nixos/_mixins/base/emacs-config.org")))
(global-set-key (kbd "C-c e") 'zb/visit-emacs-config)

(defun zb/visit-nixos-config ()
(interactive)
(find-file (concat nix_folder "flake.nix")))
(global-set-key (kbd "C-c n") 'zb/visit-nixos-config)

(defun zb/visit-machine-nixos-config ()
(interactive)
(find-file (concat nix_folder "nixos/" (system-name) "/default.nix")))
(global-set-key (kbd "C-c m") 'zb/visit-machine-nixos-config)

(defun zb/kill-current-buffer ()
  "Kill the current buffer without prompting."
  (interactive)
  (kill-buffer (current-buffer)))

(global-set-key (kbd "C-x k") 'zb/kill-current-buffer)

(global-set-key (kbd "C-x C-b") 'ibuffer)

(setq electric-pair-pairs '(
			     (?\{ . ?\})
			     (?\( . ?\))
			     (?\[ . ?\])
			     (?\" . ?\")
			     ))
(setq electric-pair-inhibit-predicate (lambda (c) (char-equal c ?<)))
;; (setq electric-pair-inhibit-predicate
;;     `(lambda (c)
;;        (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c)))))

(electric-pair-mode t)
(show-paren-mode 1)

(use-package rainbow-mode
  :ensure t
  :init
  (add-hook 'prog-mode-hook 'rainbow-mode))

(use-package rainbow-delimiters
  :ensure t
  :init
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

(use-package expand-region
  :ensure t
  :bind ("C-q" . er/expand-region))

(setq org-fontify-done-headline t)
(custom-set-faces
 '(org-done ((t (:foreground "PaleGreen"
                             :weight normal
                             :strike-through t))))
 '(org-headline-done
   ((((class color) (min-colors 16) (background dark))
     (:foreground "LightSalmon" :strike-through t)))))

;  (define-key global-map "\C-cl" 'org-store-link)
 ;; (define-key global-map "\C-ca" 'org-agenda)
  (define-key global-map "\C-cc" 'org-capture)
