nixos/_mixins/base/emacs-config.org
** Todo custumizations
#+begin_src emacs-lisp
    (define-key global-map "\C-c \C-t" 'org-todo)
    (setq org-todo-keywords
	'((sequence "TODO(t)" "ACTIVE(a)" "|" "DONE(d)")
	  ;; (sequence "REPORT(r)" "BUG(b)" "KNOWNCAUSE(k)" "|" "FIXED(f)")
	  (sequence "|" "CANCELED(c)")))

  (setq org-todo-keyword-faces
	'(("TODO" . org-warning) ("ACTIVE" . "yellow")
	  ("CANCELED" . (:foreground "blue" :weight bold))))
#+end_src

** Org-Capture
#+begin_src emacs-lisp
  (defvar org-tasks (concat sync_folder "org/inbox.org"))
;;  (defvar org-tasks (concat sync_folder "org/gtd.org"))
  (defvar org-journal (concat sync_folder "org/journal.org"))
  (defvar org-shopping (concat sync_folder "org/shopping.org"))
  (defvar org-gtd (concat sync_folder "org/gtd.org"))
  (defvar org-cookbook (concat sync_folder "org/cookbook.org"))
  (defvar org-book-path (concat sync_folder "org/books.org" ))

   (setq org-capture-templates
     '(
       ("t" "Todo" entry (file+headline  org-tasks "Tasks")
    "* TODO %?\n  %i\n  %a")
       ("j" "Journal" entry (file+datetree org-journal)
    "* %?\nEntered on %U\n  %i\n  %a")
       ("s" "Shopping" entry (file+headline org-shopping "Shopping")
    "* TODO %?\n %i")
       ("g" "Groceries" entry (file+headline org-shopping "Groceries")
    "* TODO %?\n %i")
       ("m" "Media" entry (file+headline org-shopping "Media")
    "* TODO %?\n %i")
       ("x" "testing" entry (file+headline org-gtd "Tasks")
  "* TODO %^{prompt}\n  %a")
   ; Org-Chef particular
       ("c" "Cookbook" entry (file org-cookbook)
     "%(org-chef-get-recipe-from-url)"
     :empty-lines 1)
       ("m" "Manual Cookbook" entry (file org-cookbook)
     "* %^{Recipe title: }\n  :PROPERTIES:\n  :source-url:\n  :servings:\n  :prep-time:\n  :cook-time:\n  :ready-in:\n  :END:\n** Ingredients\n   %?\n** Directions\n\n")
       ("bm" "Book" entry (file org-book-path)
	 "* %^{TITLE}\n:PROPERTIES:\n:ADDED: %<[%Y-%02m-%02d]>\n:END:%^{AUTHOR}p\n%?" :empty-lines 1)
     ("b" "Book url" entry (file org-book-path)
	     "%(let* ((url (substring-no-properties (current-kill 0)))
		  (details (org-book-path-get-details url)))
	     (when details (apply #'org-book-path-format 1 details)))")
      )
   )
#+end_src

** Org-Roam
I want to use something like the Zettlekasten method to sort all my random notes / thoughts. Keep hearing about Roam to do that, and if it can be done it can be done in Emacs.

Here's something based on a [[https://systemcrafters.net/build-a-second-brain-in-emacs/getting-started-with-org-roam/][blog]] to start with.
#+begin_src emacs-lisp
  (use-package org-roam
    ;; :ensure t  ; I use emacs-overlay to manage packages
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/Sync/personal/RoamNotes")
    (org-roam-completion-everywhere t)
    ;; use built in sqlite in Emacs 29+
    (setq org-roam-database-connector 'sqlite-builtin)
    :bind
    (
     ("C-c r l" . org-roam-buffer-toggle)
     ("C-c r f" . org-roam-node-find)
     ("C-c r i" . org-roam-node-insert)
     :map org-mode-map
     ("C-M-i"    . completion-at-point)
     )

    :config
    (org-roam-setup)
  )
#+end_src


* Test zone
** Org-Chef
record and organize cooking recipes. Uses org-capture and can parse recipes from some sites
#+begin_src emacs-lisp
  (use-package org-chef
    :ensure t)
#+end_src

** Org-Book
   way to catalog what you've read / reading
   #+begin_src emacs-lisp
	  (use-package org-books
	    :ensure t)
	  (setq org-books-file org-book-path)
	  ;; (setq org-capture-templates
	  ;;    '(("bl" "Book log" item (function org-books-visit-book-log)
	  ;;        "- %U %?" :prepend t)))
   #+end_src

   # #+begin_src emacs-lisp
   #     ;; Set path to the reading list org file
   #   (setq org-books-file org-book-path)
   #   ;; (setq org-books-file (concat sync_folder "org/books.org"))
   #     ;; A basic template file can be generated using the function `org-books-create-file'.
   # #+end_src

** Yasnippet
#+begin_src emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
      (use-package yasnippet-snippets
	:ensure t)
      (yas-reload-all))
(yas-global-mode t)
#+end_src

** Flycheck
#+begin_src emacs-lisp
(use-package flycheck
  :ensure t)
#+end_src

** Company Mode
#+begin_src emacs-lisp
   (use-package company
     :ensure t)
    (setq company-idle-delay 0)
    (setq company-minimum-prefix-length 3) ;)
#+end_src

** Switch and rebalance windows when splitting

When splitting a window, I invariably want to switch to the new window. This
makes that automatic.

#+begin_src emacs-lisp
  (defun zb/split-window-below-and-switch ()
    "Split the window horizontally, then switch to the new pane."
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))

  (defun zb/split-window-right-and-switch ()
    "Split the window vertically, then switch to the new pane."
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))

  (global-set-key (kbd "C-x 2") 'zb/split-window-below-and-switch)
  (global-set-key (kbd "C-x 3") 'zb/split-window-right-and-switch)
#+end_src

** Dashboard

#+begin_src emacs-lisp
  (defun my/dashboard-banner ()
    """Set a dashboard banner including information on package
       initialization time and garbage collections."""
    (setq dashboard-banner-logo-title
	  (format "Emacs ready in %.2f seconds with %d garbage collections."
		  (float-time (time-subtract after-init-time before-init-time)) gcs-done)))

  (use-package dashboard
    :init
    (add-hook 'after-init-hook 'dashboard-refresh-buffer)
    (add-hook 'dashboard-mode-hook 'my/dashboard-banner)
    :config
    (setq dashboard-startup-banner 'logo)
    (dashboard-setup-startup-hook))
#+end_src

** Native Compiling
#+begin_src emacs-lisp
;; Silence compiler warnings as they can be pretty disruptive
(setq comp-async-report-warnings-errors nil)
#+end_src

# * Org-mode
# ** Agenda
# Most of this came from a [[https://blog.aaronbieber.com/2016/09/24/an-agenda-for-life-with-org-mode.html][blog post]] by aaron bieber.
# *** Custom commands
# #+begin_src emacs-lisp
# (global-set-key "\C-ca" 'org-agenda)
# #+end_src

# *** Where to look
# #+begin_src emacs-lisp
# (setq org-agenda-files '("~/sync/Nextcloud/calendar_agenda")
# #+end_src

# *** Custom commands for filtering
# #+begin_src emacs-lisp
# (defun air-org-skip-subtree-if-habit ()
#   "Skip an agenda entry if it has a STYLE property equal to \"habit\"."
#   (let ((subtree-end (save-excursion (org-end-of-subtree t))))
#     (if (string= (org-entry-get nil "STYLE") "habit")
#         subtree-end
#       nil)))
# #+end_src

# #+begin_src emacs-lisp
# (defun air-org-skip-subtree-if-priority (priority)
#   "Skip an agenda subtree if it has a priority of PRIORITY.
# PRIORITY may be one of the characters ?A, ?B, or ?C."
#   (let ((subtree-end (save-excursion (org-end-of-subtree t)))
#         (pri-value (* 1000 (- org-lowest-priority priority)))
#         (pri-current (org-get-priority (thing-at-point 'line t))))
#     (if (= pri-value pri-current)
#         subtree-end
#       nil)))
# #+end_src

# *** combined view
# #+begin_src emacs-lisp
# (setq org-agenda-custom-commands
#       '(("d" "Daily agenda and all TODOs"
#          ((tags "PRIORITY=\"A\""
#                 ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
#                  (org-agenda-overriding-header "High-priority unfinished tasks:")))
#           (agenda "" ((org-agenda-ndays 1)))
#           (alltodo ""
#                    ((org-agenda-skip-function '(or (air-org-skip-subtree-if-habit)
#                                                    (air-org-skip-subtree-if-priority ?A)
#                                                    (org-agenda-skip-if nil '(scheduled deadline))))
#                     (org-agenda-overriding-header "ALL normal priority tasks:"))))
#          ((org-agenda-compact-blocks t)))))
# #+end_src

* Programming
** Language Server
Set up the lsp for other modes to hook into
#+begin_src emacs-lisp
  (use-package lsp-mode
    :ensure t
;    :if my-laptop-p
    :config
    (add-hook 'python-mode-hook #'lsp))
#+end_src

** Python
*** Ruff formatter
# #+begin_src emacs-lisp
# (use-package reformatter
#   :hook
#   (python-mode . ruff-format-on-save-mode)
#   (python-ts-mode . ruff-format-on-save-mode)
#   :config
#   (reformatter-define ruff-format
#     :program "ruff"
#     :args `("format" "--stdin-filename" ,buffer-file-name "-")))
# #+end_src

*** Jedi

Use-package blurb that I got from the lsp-jedi GitHub.
Currently testing python-lsp-server, so this section
is commented out.

#+begin_src emacs-lisp
(use-package lsp-jedi
  :ensure t
  :config
  (with-eval-after-load "lsp-mode"
    (add-to-list 'lsp-disabled-clients 'pyls)
    (add-to-list 'lsp-enabled-clients 'jedi)))
#+end_src

*** Python-lsp-server
#+begin_src emacs-lisp
    (use-package lsp-mode
      :if my-laptop-p
      :ensure t
      :hook
      ((python-mode . lsp)))

    (use-package lsp-ui
      :if my-laptop-p
      :ensure t
      :commands lsp-ui-mode)


  (use-package lsp-mode
    :if my-laptop-p
    :ensure t
    :config
    (lsp-register-custom-settings
     '(("pyls.plugins.pyls_mypy.enabled" t t)
       ("pyls.plugins.pyls_mypy.live_mode" nil t)
       ("pyls.plugins.pyls_black.enabled" t t)
       ("pyls.plugins.pyls_isort.enabled" t t)))
    :hook
    ((python-mode . lsp)))

#+end_src

*** Blacken
#+begin_src emacs-lisp
  (use-package blacken
    :ensure t
    :hook
    ((python-mode . lsp)))

#+end_src

* Treemacs
#+begin_src emacs-lisp
  (use-package treemacs
    :ensure t)
  (use-package treemacs-projectile
    :after (treemacs projectile)
    :ensure t)

  (use-package treemacs-icons-dired
    :hook (dired-mode . treemacs-icons-dired-enable-once)
    :ensure t)

  (use-package treemacs-magit
    :after (treemacs magit)
    :ensure t)
#+end_src

