nixos/_mixins/base/emacs-config.el

(define-key global-map "\C-c \C-t" 'org-todo)
  (setq org-todo-keywords
	'((sequence "TODO(t)" "ACTIVE(a)" "|" "DONE(d)")
	  ;; (sequence "REPORT(r)" "BUG(b)" "KNOWNCAUSE(k)" "|" "FIXED(f)")
	  (sequence "|" "CANCELED(c)")))

(setq org-todo-keyword-faces
	'(("TODO" . org-warning) ("ACTIVE" . "yellow")
	  ("CANCELED" . (:foreground "blue" :weight bold))))

(defvar org-tasks (concat sync_folder "org/inbox.org"))
;;  (defvar org-tasks (concat sync_folder "org/gtd.org"))
  (defvar org-journal (concat sync_folder "org/journal.org"))
  (defvar org-shopping (concat sync_folder "org/shopping.org"))
  (defvar org-gtd (concat sync_folder "org/gtd.org"))
  (defvar org-cookbook (concat sync_folder "org/cookbook.org"))
  (defvar org-book-path (concat sync_folder "org/books.org" ))

   (setq org-capture-templates
     '(
       ("t" "Todo" entry (file+headline  org-tasks "Tasks")
    "* TODO %?\n  %i\n  %a")
       ("j" "Journal" entry (file+datetree org-journal)
    "* %?\nEntered on %U\n  %i\n  %a")
       ("s" "Shopping" entry (file+headline org-shopping "Shopping")
    "* TODO %?\n %i")
       ("g" "Groceries" entry (file+headline org-shopping "Groceries")
    "* TODO %?\n %i")
       ("m" "Media" entry (file+headline org-shopping "Media")
    "* TODO %?\n %i")
       ("x" "testing" entry (file+headline org-gtd "Tasks")
  "* TODO %^{prompt}\n  %a")
   ; Org-Chef particular
       ("c" "Cookbook" entry (file org-cookbook)
     "%(org-chef-get-recipe-from-url)"
     :empty-lines 1)
       ("m" "Manual Cookbook" entry (file org-cookbook)
     "* %^{Recipe title: }\n  :PROPERTIES:\n  :source-url:\n  :servings:\n  :prep-time:\n  :cook-time:\n  :ready-in:\n  :END:\n** Ingredients\n   %?\n** Directions\n\n")
       ("bm" "Book" entry (file org-book-path)
	 "* %^{TITLE}\n:PROPERTIES:\n:ADDED: %<[%Y-%02m-%02d]>\n:END:%^{AUTHOR}p\n%?" :empty-lines 1)
     ("b" "Book url" entry (file org-book-path)
	     "%(let* ((url (substring-no-properties (current-kill 0)))
		  (details (org-book-path-get-details url)))
	     (when details (apply #'org-book-path-format 1 details)))")
      )
   )

(use-package org-roam
  ;; :ensure t  ; I use emacs-overlay to manage packages
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/Sync/personal/RoamNotes")
  (org-roam-completion-everywhere t)
  ;; use built in sqlite in Emacs 29+
  (setq org-roam-database-connector 'sqlite-builtin)
  :bind
  (
   ("C-c r l" . org-roam-buffer-toggle)
   ("C-c r f" . org-roam-node-find)
   ("C-c r i" . org-roam-node-insert)
   :map org-mode-map
   ("C-M-i"    . completion-at-point)
   )

  :config
  (org-roam-setup)
)

(use-package org-chef
  :ensure t)

(use-package org-books
  :ensure t)
(setq org-books-file org-book-path)
;; (setq org-capture-templates
;;    '(("bl" "Book log" item (function org-books-visit-book-log)
;;        "- %U %?" :prepend t)))

(use-package yasnippet
    :ensure t
    :config
      (use-package yasnippet-snippets
	:ensure t)
      (yas-reload-all))
(yas-global-mode t)

(use-package flycheck
  :ensure t)

(use-package company
  :ensure t)
 (setq company-idle-delay 0)
 (setq company-minimum-prefix-length 3) ;)

(defun zb/split-window-below-and-switch ()
  "Split the window horizontally, then switch to the new pane."
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))

(defun zb/split-window-right-and-switch ()
  "Split the window vertically, then switch to the new pane."
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))

(global-set-key (kbd "C-x 2") 'zb/split-window-below-and-switch)
(global-set-key (kbd "C-x 3") 'zb/split-window-right-and-switch)

(defun my/dashboard-banner ()
  """Set a dashboard banner including information on package
     initialization time and garbage collections."""
  (setq dashboard-banner-logo-title
	  (format "Emacs ready in %.2f seconds with %d garbage collections."
		  (float-time (time-subtract after-init-time before-init-time)) gcs-done)))

(use-package dashboard
  :init
  (add-hook 'after-init-hook 'dashboard-refresh-buffer)
  (add-hook 'dashboard-mode-hook 'my/dashboard-banner)
  :config
  (setq dashboard-startup-banner 'logo)
  (dashboard-setup-startup-hook))

;; Silence compiler warnings as they can be pretty disruptive
(setq comp-async-report-warnings-errors nil)

(use-package lsp-mode
    :ensure t
;    :if my-laptop-p
    :config
    (add-hook 'python-mode-hook #'lsp))

(use-package lsp-jedi
  :ensure t
  :config
  (with-eval-after-load "lsp-mode"
    (add-to-list 'lsp-disabled-clients 'pyls)
    (add-to-list 'lsp-enabled-clients 'jedi)))

(use-package lsp-mode
    :if my-laptop-p
    :ensure t
    :hook
    ((python-mode . lsp)))

  (use-package lsp-ui
    :if my-laptop-p
    :ensure t
    :commands lsp-ui-mode)


(use-package lsp-mode
  :if my-laptop-p
  :ensure t
  :config
  (lsp-register-custom-settings
   '(("pyls.plugins.pyls_mypy.enabled" t t)
     ("pyls.plugins.pyls_mypy.live_mode" nil t)
     ("pyls.plugins.pyls_black.enabled" t t)
     ("pyls.plugins.pyls_isort.enabled" t t)))
  :hook
  ((python-mode . lsp)))

(use-package blacken
  :ensure t
  :hook
  ((python-mode . lsp)))

(use-package treemacs
  :ensure t)
(use-package treemacs-projectile
  :after (treemacs projectile)
  :ensure t)

(use-package treemacs-icons-dired
  :hook (dired-mode . treemacs-icons-dired-enable-once)
  :ensure t)

(use-package treemacs-magit
  :after (treemacs magit)
  :ensure t)
