nixos/_mixins/base/emacs-config.org
* LaTeX
#+begin_src emacs-lisp
    (setq-default TeX-engine 'xetex) ;;change the default engine to XeTeX
  ;; engines - xelatex, pdflatex, default
    (setq-default TeX-PDF-mode t)
  ;;  (latex-preview-pane-enable)`
#+end_src

* Tramp
#+begin_src
    (setq tramp-default-method "ssh")
#+end_src

* [[https://github.com/justbur/emacs-which-key][Which-Key]]
Displays the key bindings following your currently entered incomplete command (a prefix) in a popup.
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t)
  (setq which-key-mode t)
#+end_src

# #+begin_src emacs-lisp
#   (which-key-setup-side-window-right)
# #+end_src


* INI-Mode
#+begin_src emacs-lisp
  (use-package ini-mode
    :ensure t)
  (setq which-key-mode t)
#+end_src
