nixos/_mixins/base/emacs-config.el

(setq-default TeX-engine 'xetex) ;;change the default engine to XeTeX
;; engines - xelatex, pdflatex, default
  (setq-default TeX-PDF-mode t)
;;  (latex-preview-pane-enable)`

(use-package which-key
  :ensure t)
(setq which-key-mode t)

(use-package ini-mode
  :ensure t)
(setq which-key-mode t)
